Revit 2027 API
RevolvedSurface.GetProfileCurveInWorldCoordinates Method
 Returns a copy of the profile curve expressed in the world coordinate system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve GetProfileCurveInWorldCoordinates()
Public Function GetProfileCurveInWorldCoordinates As Curve
public:
Curve^ GetProfileCurveInWorldCoordinates()
member GetProfileCurveInWorldCoordinates : unit -> Curve
Return Value
Curve
 A copy of the profile curve in the world coordinate system.
See Also
Reference
RevolvedSurface Class
Autodesk.Revit.DB Namespace